{
  "about": [
    {
      "p1": "A feast of Hearty, Homey, Heavenly and Happy Flavors. That’s what’s been said, and many more continue to whisper and declare, once they have experienced the succulent, no frills but so good food and pastries of [H] Cuisine."
    },
    {
      "p2": "Today, we are known for being the Home of the Most Awesome Angus Beef Belly with Demiglace Gravy and other “solid” beef dishes such as Osso Buco, Lengua con Cetas and Callos ala Don Juan. These are just some of our many sumptuous and delightful creations."
    },
    {
      "p3": "[H] Cuisine is a Food Service Company that gives you the utmost importance and offers you an excellent set of choices and options for all your food needs – food trays, bulk packed food, gourmet gifts, souvenirs, seasonal giveaways, catering and even a private chef service – for all your occasions."
    },
    {
      "p4": "We adhere to our culinary practice, standards, and service and believe in premium quality, with the end-result of optimum taste, for all our food and pastry products."
    },
    {
      "p5": "Established and led by Chef Hannah Herrera-Bagatsing, one of the country’s young and emerging culinary minds, [H] Cuisine is an enterprise in pure gastronomy and proudly serves the every desire of those who love to eat."
    },
    {
      "p6": "Chef Hannah has come a long way from being the favorite little great-grand daughter of the owners of the once popular Tres Hermanas Restaurants. Her achievements in the culinary world, at a young age, speak wonders. A Chef Instructor and Consultant who used to be a resident Chef of a television cooking show after graduating at the top of her Culinary Class and being the Kitchen Operations Manager of a Chain of Restaurants, Chef Hannah still manages to accomplish great strides in the cuisine scene. Chef Hannah and her team have cooked and prepared splendid feasts for many people, including presidents and celebrities and have maintained a loyal stream of clientele to which [H] Cuisine is grateful for."
    },
    {
      "p7": "As the founder, General Manager and Executive Chef of [H] Cuisine , Chef Hannah believes that there is still so much to learn, and, most importantly, contribute to the ever-growing and dynamic universe of food. And for as long as there are those like you who love and enjoy the experience of Hannah’s Cuisine, Chef Hannah will always be churning up and dishing out the culinary magic of [H] Cuisine."
    }
  ]
}
